---
title: InaccurateFailures
classe: Autodesk.Revit.DB.BuiltInFailures+InaccurateFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# InaccurateFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId InaccurateAreaLine { get; }` | `InaccurateFailures.InaccurateAreaLine` | FailureDefinitionId |
| `FailureDefinitionId InaccurateBeamOrBrace { get; }` | `InaccurateFailures.InaccurateBeamOrBrace` | FailureDefinitionId |
| `FailureDefinitionId InaccurateCurveBasedFamily { get; }` | `InaccurateFailures.InaccurateCurveBasedFamily` | FailureDefinitionId |
| `FailureDefinitionId InaccurateDriveCurve { get; }` | `InaccurateFailures.InaccurateDriveCurve` | FailureDefinitionId |
| `FailureDefinitionId InaccurateGrid { get; }` | `InaccurateFailures.InaccurateGrid` | FailureDefinitionId |
| `FailureDefinitionId InaccurateLevel { get; }` | `InaccurateFailures.InaccurateLevel` | FailureDefinitionId |
| `FailureDefinitionId InaccurateLine { get; }` | `InaccurateFailures.InaccurateLine` | FailureDefinitionId |
| `FailureDefinitionId InaccurateMassingSketchLine { get; }` | `InaccurateFailures.InaccurateMassingSketchLine` | FailureDefinitionId |
| `FailureDefinitionId InaccurateRefPlane { get; }` | `InaccurateFailures.InaccurateRefPlane` | FailureDefinitionId |
| `FailureDefinitionId InaccurateRoomSeparation { get; }` | `InaccurateFailures.InaccurateRoomSeparation` | FailureDefinitionId |
| `FailureDefinitionId InaccurateSketchLine { get; }` | `InaccurateFailures.InaccurateSketchLine` | FailureDefinitionId |
| `FailureDefinitionId InaccurateSpaceSeparation { get; }` | `InaccurateFailures.InaccurateSpaceSeparation` | FailureDefinitionId |
| `FailureDefinitionId InaccurateWall { get; }` | `InaccurateFailures.InaccurateWall` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```